---
kind: enumMember
id: F:Autodesk.Revit.DB.AllowedValues.NonNegative
enum: Autodesk.Revit.DB.AllowedValues
source: html/a777713f-d3be-3c45-29ee-09f9c7a83d9f.htm
---
# Autodesk.Revit.DB.AllowedValues.NonNegative

Only non-negative values are allowed. A tolerance of 1.0e-9 is used, so very small negative numbers are accepted.